-- member --
INSERT IGNORE INTO member (id, account, password, joined_at)
VALUES (1, 'tenten', '$2a$10$D71pfBoMosZhqD40KxsVSeACUYROy7VSHPlEGgg8Tr6hvCJXogcAK', NOW());

-- restaurant --
INSERT INTO restaurant (name, zip_code, address, cuisine, x, y, phone_number, homepage_url,
                        avg_score, view_count, updated_at)
VALUES ('매취랑 동대문점', '100-851', '서울특별시 중구 을지로6가 18-137', '한식', 200614.497822789, 451667.793301393,
        NULL, NULL, 0.0, 0, NOW()),
       ('BLUE BOX(블루박스)', '139-802', '서울특별시 노원구 공릉동 334-3', '기타', 206888.278816502,
        457681.129401558, NULL, NULL, 0.0, 0, NOW()),
       ('치카바', '138-803', '서울특별시 송파구 가락동 84-6', '일식', 210536.379531854, 443748.684430769,
        '02 448 6648', NULL, 0.0, 0, NOW()),
       ('오고보', '138-828', '서울특별시 송파구 방이동 57 One57빌딩', '경양식', 209835.419891828, 445884.536808795,
        NULL, NULL, 0.0, 0, NOW()),
       ('또봉이통닭 가락본동점', '138-801', '서울특별시 송파구 가락동 46-11 문종빌딩', '호프/통닭', 210694.913956667,
        444077.25458923, '02 64651515', NULL, 0.0, 0, NOW()),
       ('포케올데이', '139-804', '서울특별시 노원구 공릉동 441-152', '한식', 206777.482930833, 458375.201956698, NULL,
        NULL, 0.0, 0, NOW()),
       ('양이야기', '138-888', '서울특별시 송파구 문정동 644 문정현대지식산업센터1-1', '탕류(보신용)', 210879.251613939,
        447675.739670456, NULL, NULL, 0.0, 0, NOW()),
       ('대치동그집1981', '134-850', '서울특별시 강동구 성내동 537-3', '한식', 212416.334313854, 449042.643309731,
        NULL, NULL, 0.0, 0, NOW()),
       ('왔따쪽갈비', '134-861', '서울특별시 강동구 천호동 46-28', '한식', 197228.18297893, 452706.97234696, NULL,
        NULL, 0.0, 0, NOW()),
       ('서촌 곳간', '110-044', '서울특별시 종로구 필운동 146-1 아이에스빌딩 1층', '한식', 197228.18297893, 452706.97234696,
        NULL, NULL, 0.0, 0, NOW()),
       ('복림문', '100-869', '서울특별시 중구 황학동 450', '중국식', 201722.540160044, 451689.215255174, NULL, NULL,
        0.0, 0, NOW()),
       ('카페 라', '100-856', '서울특별시 중구 장충동2가 202', '기타', 200463.625303538, 450497.460903907, NULL,
        NULL, 0.0, 0, NOW()),
       ('역전우동0410 숙대입구점', '140-133', '서울특별시 용산구 청파동3가 22-2', '일식', 197323.765241203,
        449118.950056912, NULL, NULL, 0.0, 0, NOW()),
       ('끼(KKI)', '140-833', '서울특별시 용산구 용산동2가 1-510', '외국음식전문점(인도,태국등)', 198593.055505142,
        449214.246833049, NULL, NULL, 0.0, 0, NOW()),
       ('마라공방', '152-826', '서울특별시 구로구 고척동 76-153', '중국식', 188132.565624313, 444217.948267109, NULL,
        NULL, 0.0, 0, NOW());

-- review --
INSERT INTO review (content, score, created_at, member_id, restaurant_id)
SELECT NULL, FLOOR(1 + (RAND() * 5)), NOW(), 1, r.id
FROM restaurant r,
     (SELECT 1
      FROM SYSTEM_RANGE(1, 20)) tmp
WHERE RAND() < 0.75;

UPDATE restaurant r
SET avg_score = (SELECT IFNULL(ROUND(AVG(score), 2), 0.0) FROM review WHERE restaurant_id = r.id);